# Работа с файлами

https://proglib.io/p/rabota-s-faylami-v-python-5-zadach-dlya-nachinayushchih-s-resheniyami-2022-06-02

## Анализ файла
Имеется файл `file.txt` с текстом на латинице. Напишите программу, которая выводит следующую статистику по тексту:
_количество букв латинского алфавита;
число слов;
число строк._

Предположим, что `file.txt` содержит приведенный ниже текст:
```text
Beautiful is better than ugly.
Explicit is better than implicit.
Simple is better than complex.
Complex is better than complicated.
```

В этом случае программа должна вывести информацию о файле в следующем виде:       
```
Входной файл содержит:
108 букв
20 слов
4 строки
```

<details><summary>Решение</summary>
<pre>
file = open('file.txt', 'r')

r = file.readlines()
letters = 0
words = 0
lines = len(r)

for x in r:
    line = x.replace('\n', '').replace('.', '').split(' ')
    print(line)
    words += len(line)
    letters += len(''.join(line))

print(lines, 'lines')
print(words, 'words')
print(letters, 'letters')
</pre>
</details>