# Циклы
## От нуля до `n`
Пользователь вводит число `n`. Далее необходимо, чтобы программа начала перечислять числа от `0` до `n`.
Если число `n` меньше нуля, то отсчет идет в соответствующую сторону, от нуля к минусовым значениям: `0, -1, -2, -3` и т.д. Если больше нуля, то: `0, 1, 2, 3` и т.д. Примеры:
>Входные данные: `8`\
Выходные данные: `0,1,2,3,4,5,6,7,8`

>Входные данные: `-3`\
Выходные данные: `0,-1,-2,-3`

<details><summary>Решение</summary>
<pre>
n = -10
step = 1 if n > 0 else -1
for x in range(0, n+step, step):
    print(x)
</pre>
</details>

## Пирамида
Напишите программу для построения следующего шаблона, используя вложенный цикл for:
```
 * 
 * * 
 * * * 
 * * * * 
 * * * * * 
 * * * * 
 * * * 
 * * 
 *
```

<details><summary>Решение</summary>
<pre>
s = '*'
for x in range(1,11):
    if x <= 5: print(s * x)
    else: print(s * (10 - x))
</pre>
</details>

## Буква алфавита
_(Необходимы знания сравнения строк или chr() ord())_

Пользователю предлагается ввести один символ. Нужно выяснить, входит ли символ в русский или английский алфавит, если да, то написать в какой. Примеры:
>Входные данные: `'П'`\
Выходные данные: `'Буква русского алфавита'`

>Входные данные: `'j'`\
Выходные данные: `'Буква английского алфавита'`

>Входные данные: `'&'`\
Выходные данные: `'Символ не входит в рус/англ алфавиты'`

## Список с алфавитом
Сгенерировать список, который состоит из алфавита. Ожидаемый результат: 
```
['а', 'б', 'в', 'г', 'д', 'е', 'ж', 'з', 'и', 'й', 'к', 'л',
'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч',
'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я']
```

<details><summary>Решение</summary>
<pre>
A = [chr(x) for x in range(1072, 1103+1)]
</pre>
</details>

## Первый-второй-первый
В классе `N` школьников. На уроке физкультуры тренер говорит «на первый-второй рассчитайтесь».
Выведите, что скажут ученики.

**Входные данные**: Вводится одно целое число — количество человек в классе.
**Входные данные**: Выведите последовательность чисел `1` и `2`, в том порядке, как будут говорить школьники.
Пример:
>Входные данные: `5`\
>Выходные данные:
>```
>1
>2
>1
>2
>1
>```

<details><summary>Решение</summary>
<pre>
n = int(input())
for i in range(n):
    if i % 2 == 0:
        print(1)
    else:
        print(2)
</pre>
</details>

## Количество четных чисел
Вводятся `N` чисел. Посчитайте, сколько среди них четных.

**Входные данные**: На первой строке вводится одно число `N`. Далее следуют `N` строк по одному числу на каждой — заданные числа.
**Входные данные**: Выведите ответ на задачу.

Пример:
>Входные данные:
>```
>4
>10
>11
>12
>13
>```
>Выходные данные: `2`

<details><summary>Решение</summary>
<pre>
n = int(input())
k = 0
for i in range(n):
    x = int(input())
    if x % 2 == 0:
        k += 1
print(k)
</pre>
</details>

## Cумма от 1 до N
Посчитайте сумму `1 + 2 + 3 + ... + N`.

**Входные данные**: Вводится одно целое число `N`.
**Входные данные**: Выведите искомую сумму.

Примеры:

>Входные данные: `2`\
Выходные данные: `3`

>Входные данные: `5`\
Выходные данные: `15`

<details><summary>Решение</summary>
<pre>
n = int(input())
k = 0
for i in range(1, n + 1):
    k = k + i
print(k)
</pre>
</details>

## Маша и телефон
Маша хочет накопить на новый телефон. Телефон стоит `N` рублей. Маша может откладывать `K` рублей в день каждый день, за исключением воскресенья, когда она тратит деньги на поход в кино. Маша начинает копить в понедельник. За сколько дней она накопит нужную сумму?
**Входные данные**: Вводятся два числа `N` и `K`.
**Входные данные**: Выведите искомое количество дней

Примеры:
>Входные данные: `100 50`\
Выходные данные: `2`

>Входные данные: `100 10`\
Выходные данные: `11`

<details><summary>Решение</summary>
<pre>
n, k = map(int, input().split())
day = 1
s = 0
while s < n:
    if day % 7 != 0:
        s = s + k
    day = day + 1
print(day - 1)
</pre>
</details>