# Циклы

## Реверс слова

Напишите программу, которая принимает слово от пользователя и переворачивает его. Пример:

> Входные данные: `'аллея'`\
> Выходные данные: `'яелла'`

## Реверс, если есть 'о'

Напишите программу, которая принимает строку и переворачивает ее в том случае, если в этой строке есть буква `o`. Иначе вывести значение `nil`. Примеры:

> Входные данные: `'остров'`\
> Выходные данные: `'вортсо'`

> Входные данные: `'рыба'`\
> Выходные данные: `nil`

## Палиндром

Напишите программу, которая проверяет, является ли строка палиндромом. (`Палиндром` - это слово или фраза, которые одинаково читаются слева направо и справа налево.)
Примеры:

> Входные данные: `"Заказ"`\
> Выходные данные: `"Yes"`

> Входные данные: `"Теплица"`\
> Выходные данные: `"No"`

## От нуля до n

Пользователь вводит число `n`. Далее необходимо, чтобы программа начала перечислять числа от `0` до `n`.
Если число `n` меньше нуля, то отсчет идет в соответствующую сторону, от нуля к минусовым значениям: `0, -1, -2, -3` и т.д. Если больше нуля, то: `0, 1, 2, 3` и т.д. Примеры:

> Входные данные: `8`\
> Выходные данные: `0,1,2,3,4,5,6,7,8`

> Входные данные: `-3`\
> Выходные данные: `0,-1,-2,-3`

```{toggle}
```lua
n = -10
if n > 0 then step = 1
else step = -1 end
for x = 0, n, step do
    print(x)
end
```

## Пирамида

Напишите программу для построения следующего шаблона, используя циклы:

```
* 
* * 
* * * 
* * * * 
* * * * * 
* * * * 
* * * 
* * 
*
```

```{toggle}
```lua
stars = '*'
for i = 1, 10 do
    print(stars)
    if i <= 5 then
        stars = stars .. '*'
    else
        stars = stars:sub(1, string.len(stars) - 1)
    end
end
```

## Первый-второй-первый

В классе `N` школьников. На уроке физкультуры тренер говорит «на первый-второй рассчитайтесь».
Выведите, что скажут ученики.\
**Входные данные**: Вводится одно целое число — количество человек в классе.\
**Входные данные**: Выведите последовательность чисел `1` и `2`, в том порядке, как будут говорить школьники.
Пример:

> Входные данные: `5`\
> Выходные данные:
> 
> ```
> 1
> 2
> 1
> 2
> 1
> ```

```{toggle}
```lua
n = tonumber(io.read())
for i = 1, n do
    if i % 2 == 1 then
        print(1)
    else
        print(2)
    end
end
```

## Цифра 3 в таблице

Дана произвольная таблица с числами.
Напишите программу, которая выводит `'YES'`, если в таблице присутствует цифра `3`, иначе выводится `'NO'`. Примеры:

> Таблица: `{9, 10, 3, -4, 7, 93}`\
> Ожидаемый результат: `YES`

> Таблица `{41,6,32}`\
> Ожидаемый результат: `NO`

## Количество четных чисел

Вводятся `N` чисел. Посчитайте, сколько среди них четных.\
**Входные данные**: На первой строке вводится одно число. Далее следуют строк по одному числу на каждой — заданные числа.\
**Входные данные**: Выведите ответ на задачу.

Пример:

> Входные данные:
> 
> ```
> 4
> 10
> 11
> 12
> 13
> ```
> 
> Выходные данные: `2`

```{toggle}
```lua
n = tonumber(io.read())
k = 0
for i = 1, n do
    x = tonumber(io.read())
    if x % 2 == 0 then
        k = k + 1
    end
end
print(k)
```

## Cумма от 1 до N

Посчитайте сумму `1 + 2 + 3 + ... + N`.\
**Входные данные**: Вводится одно целое число \
**Входные данные**: Выведите искомую сумму.

Примеры:

> Входные данные: `2`\
> Выходные данные: `3`

> Входные данные: `5`\
> Выходные данные: `15`

```{toggle}
```lua
n = tonumber(io.read())
k = 0
for i = 1, n do
    k = k + i
end
print(k)
```

## Маша и телефон

Маша хочет накопить на новый телефон. Телефон стоит  рублей. Маша может откладывать рублей в день каждый день, за исключением воскресенья, когда она тратит деньги на поход в кино. Маша начинает копить в понедельник. За сколько дней она накопит нужную сумму?\
**Входные данные**: Вводятся два числа `N` и `K`.\
**Входные данные**: Выведите искомое количество дней

Примеры:

> Входные данные: `100 50`\
> Выходные данные: `2`

> Входные данные: `100 10`\
> Выходные данные: `11`

```{toggle}
```lua
enter = io.read()
i = string.find(enter, ' ')
n = enter:sub(1, i - 1)
k = enter:sub(i + 1)
n, k = tonumber(n), tonumber(k)
day = 1
s = 0
while s < n do
    if day % 7 ~= 0 then
        s = s + k
    end
    day = day + 1
end
print(day - 1)
```

## Буква алфавита

Пользователю предлагается ввести один символ. Нужно выяснить, входит ли символ в русский или английский алфавит, если да, то написать в какой. Примеры:

> Входные данные: `'П'`\
> Выходные данные: `'Буква русского алфавита'`

> Входные данные: `'j'`\
> Выходные данные: `'Буква английского алфавита'`

> Входные данные: `'&'`\
> Выходные данные: `'Символ не входит в рус/англ алфавиты'`

```{toggle} Решение #1
```lua
languages = {}
languages.rus = {"й", "ц", "у", "к", "е", "н", "г", "ш", "щ", "з", "х", "ъ",
        "ф", "ы", "в", "а", "п", "р", "о", "л", "д", "ж", "э", "я",
            "ч", "с", "м", "и", "т", "ь", "б", "ю", "ё"}
languages.eng = {"q", "w", "e", "r", "t", "y", "u", "i", "o", "p", "a", "s",
        "d", "f", "g", "h", "j", "k", "l", "z", "x", "c", "v", "b", "n", "m"}
letter = 'п'
for lang, letters in pairs(languages) do
    for k, v in ipairs(letters) do
        if letter == v then
            print(lang)
            run = true
            break
        end
    end
    if run then
        break
    end
end
```

```{toggle} Решение #2
```lua
letter = 't'
if letter >= 'а' and letter <= 'я' then
    print('rus')
elseif letter >= 'a' and letter <= 'z' then
    print('eng')
end
```

## Собираемся в поход

```lua
things = {['зажигалка']=20, ['компас']=100, ['фрукты']=500, ['рубашка']=300,
          ['термос']=1000, ['аптечка']=200, ['куртка']=600, ['бинокль']=400,
        ['удочка']=1200, ['салфетки']=40, ['бутерброды']=820, ['палатка']=5500,
        ['спальный мешок']=2250, ['жвачка']=10}
```

Турист собирается в поход. Он сможет нести `N` кг вещей. Но вещей, которые он запланировал уложить в рюкзак, оказалось намного больше. Нужно определить, какие вещи от наиболее тяжелых к самым легким поместятся в рюкзак. Пример:

> Входные данные: `10`\
> Выходные данные:
> 
> ```
> палатка
> спальный мешок
> удочка
> термос
> салфетки
> жвачка
> ```

## Удаление дубликатов

Пользователь вводит через пробел произвольные данные, необходимо удалить дубликаты этих данных. Пример:

> Входные данные: `лес огород солнце очки лес имя очки`\
> Выходные данные: `лес огород солнце очки имя`
