# Новые упражнения

## Данные строки преобразовать в словарь (СЛОВАРИ)
На вход программе подаются данные в формате ключ=значение, записанные через пробел. Значениями здесь являются целые числа (см. пример ниже). Необходимо прочитать строку с этими данными и на их основе сформировать словарь d, используя функцию dict(). Результирующий словарь вывести на экран командой:

print(*sorted(d.items()))

Sample Input:
one=1 two=2 three=3

Sample Output:
{'one': 1, 'two': 2, 'three': 3}

Решение:
data = 'one=1 two=2 three=3'
data = data.split()
for i in range(len(data)):
    data[i] = data[i].split('=')

result = dict(data)
print(result)

## Таймер 
Напишите программу, которая принимает время в виде строки "00:00:00", и включает таймер на это время.
По истечению таймера необходимо вывести сообщение в консоль "Время истекло".