# Работа с файлами

## Анализ файла

Имеется файл `file.txt` с текстом на латинице. Напишите программу, которая выводит следующую статистику по тексту: количество букв латинского алфавита, число слов, число строк.

Предположим, что `file.txt` содержит приведенный ниже текст:

```txt
Beautiful is better than ugly.
Explicit is better than implicit.
Simple is better than complex.
Complex is better than complicated.
```

В этом случае программа должна вывести информацию о файле в следующем виде:       

```txt
Входной файл содержит:
108 букв
20 слов
4 строки
```

````{toggle}
```lua
local filepath = "file.txt"
local fileread = io.open(filepath, "r")
letters = 0
words = 0
lines = 0

for line in fileread:lines() do
    lines = lines + 1
    for i = 1, #line do
        symbol = line:sub(i, i)
        if (symbol >= 'a' and symbol <= 'z' or
                symbol >= 'A' and symbol <= 'Z' or
                    symbol >= 'а' and symbol <= 'я' or
                        symbol >= 'А' and symbol <= 'Я') then
            letters = letters + 1
        end
        if symbol == ' ' then
            words = words + 1
        end
    end
    words = words + 1
end

print(letters, words, lines)
```
````