# Словари

## Количество символов

Создайте словарь из строки `'pythonist'` следующим образом: в качестве ключей возьмите буквы строки, а значениями пусть будут числа, соответствующие количеству вхождений данной буквы в строку. Пример:

> Входные данные: `'pythonist'`\
> Выходные данные: `{'p': 1, 'y': 1, 't': 2, 'h': 1, 'o': 1, 'n': 1, 'i': 1, 's': 1}`

## Собираемся в поход

```python
things = {'зажигалка': 20, 'компас': 100, 'фрукты': 500, 'рубашка': 300,
          'термос': 1000, 'аптечка': 200, 'куртка': 600, 'бинокль': 400,
        'удочка': 1200, 'салфетки': 40, 'бутерброды': 820, 'палатка': 5500,
        'спальный мешок': 2250, 'жвачка': 10}
```

Турист собирается в поход. Он сможет нести `N` кг вещей. Но вещей, которые он запланировал уложить в рюкзак, оказалось намного больше. Нужно определить, какие вещи от наиболее тяжелых к самым легким поместятся в рюкзак.

> Пример ввода:
> `10`\
> Пример вывода:
> 
> ```
> палатка
> спальный мешок
> удочка
> термос
> салфетки
> жвачка
> ```


````{toggle}
```python
things = {'зажигалка': 20, 'компас': 100, 'фрукты': 500, 'рубашка': 300,
          'термос': 1000, 'аптечка': 200, 'куртка': 600, 'бинокль': 400,
        'удочка': 1200, 'салфетки': 40, 'бутерброды': 820, 'палатка': 5500,
        'спальный мешок': 2250, 'жвачка': 10}

things_swap = {}

for k, v in things.items():
    things_swap[v] = k

# things_swap = {v:k for k,v in things.items()} # альтернативный свап

things_sorted = dict(sorted(things_swap.items(), reverse=True))

N = int(input()) * 1000

for key, value in things_sorted.items():
    if key <= N:
        N -= key
        print(value)

```
````