# Работа с файлами

https://proglib.io/p/rabota-s-faylami-v-python-5-zadach-dlya-nachinayushchih-s-resheniyami-2022-06-02

## Анализ файла

Имеется файл `file.txt` с текстом на латинице. Напишите программу, которая выводит следующую статистику по тексту:
_количество букв латинского алфавита;
число слов;
число строк._

Предположим, что `file.txt` содержит приведенный ниже текст:

```text
Beautiful is better than ugly.
Explicit is better than implicit.
Simple is better than complex.
Complex is better than complicated.
```

В этом случае программа должна вывести информацию о файле в следующем виде:       

```
Входной файл содержит:
108 букв
20 слов
4 строки
```

````{toggle}
```python
file = open('text.txt', 'r')
letters = 0
words = 0
lines = 0

for line in file:
    line = line.replace("\n", "").replace(".", "")
    line = line.split(" ")
    letters += len("".join(line))
    words += len(line)
    lines += 1
    
print(letters)
print(words)
print(lines)
```
````

## Вызов исключения, если файл существует.

Записать входные данные в файл с именем "system-data.txt", если такой файл существует, то необходимо вызвать исключение со следующими действиями:
Сохранить содержимое "system-data.txt" в новый файл с именем сегодняшней даты и времени (например "24-04-2025-18-34.txt"). После этого перезаписать "system-data.txt" с новыми входными данными.