# Работа с файлами

https://proglib.io/p/rabota-s-faylami-v-python-5-zadach-dlya-nachinayushchih-s-resheniyami-2022-06-02

## Анализ файла

Имеется файл `file.txt` с текстом на латинице. Напишите программу, которая выводит следующую статистику по тексту:
_количество букв латинского алфавита;
число слов;
число строк._

Предположим, что `file.txt` содержит приведенный ниже текст:

```text
Beautiful is better than ugly.
Explicit is better than implicit.
Simple is better than complex.
Complex is better than complicated.
```

В этом случае программа должна вывести информацию о файле в следующем виде:       

```
Входной файл содержит:
108 букв
20 слов
4 строки
```

````{toggle}
```python
file = open('text.txt', 'r')
letters = 0
words = 0
lines = 0

for line in file:
    line = line.replace("\n", "").replace(".", "")
    line = line.split(" ")
    letters += len("".join(line))
    words += len(line)
    lines += 1
    
print(letters)
print(words)
print(lines)
```
````

## Вызов исключения, если файл существует.

Записать входные данные в файл с именем "system-data.txt", если такой файл существует, то необходимо вызвать исключение со следующими действиями:
Сохранить содержимое "system-data.txt" в новый файл с именем сегодняшней даты и времени (например "24-04-2025-18-34.txt"). После этого перезаписать "system-data.txt" с новыми входными данными.


## Создание уникального теста

Напишите программу для заполнения теста содержимым. Тест может иметь произвольное количество вопросов и ответов на них. Например:

````{toggle}
Пример входных данных: 
```console
Введите имя теста: Какой ты дачник?
Введите вопрос №1 (остановиться - stop): Дача нужна для того, чтобы..
Введите ответ №1 (остановиться - stop): Выращивать свои овощи и фрукты
Введите ответ №2 (остановиться - stop): Тусоваться
Введите ответ №3 (остановиться - stop): Каждый день уходить в лес
Введите ответ №4 (остановиться - stop): stop
Введите вопрос №2 (остановиться - stop): Что надо сажать в первую очередь?
Введите ответ №1 (остановиться - stop): Кабачки
Введите ответ №2 (остановиться - stop): Баклажаны
Введите ответ №3 (остановиться - stop): stop
Введите вопрос №3 (остановиться - stop): Что полезнее?
Введите ответ №1 (остановиться - stop): Петрушка
Введите ответ №2 (остановиться - stop): Укроп
Введите ответ №3 (остановиться - stop): Рукола
Введите ответ №4 (остановиться - stop): Зелёный лук
Введите ответ №5 (остановиться - stop): stop
Введите вопрос №4 (остановиться - stop): stop
```
Ожидаемый результат содержимого Json файла:
```json
{
    "name": "Какой ты дачник?",
    "questions": {
        "Дача нужна для того, чтобы..": {
            "1": "Выращивать свои овощи и фрукты",
            "2": "Тусоваться",
            "3": "Каждый день уходить в лес"
        },
        "Что надо сажать в первую очередь?": {
            "1": "Кабачки",
            "2": "Баклажаны"
        },
        "Что полезнее?": {
            "1": "Петрушка",
            "2": "Укроп",
            "3": "Рукола",
            "4": "Зелёный лук"
        }
    }
}
```
````
Решение:
````{toggle}
```python
import json

name = input("Введите имя теста: ")

count = 0
questions = {}
while True:
    count += 1
    quest = input(f"Введите вопрос №{count} (остановиться - stop): ")
    if quest == "stop":
        break
    questions[quest] = {}
    count_ans = 0
    while True:
        count_ans += 1
        answer = input(f"Введите ответ №{count_ans} (остановиться - stop): ")
        if answer == "stop":
            break
        questions[quest][count_ans] = answer

test = {"name": name,
        "questions": questions}

with open("test.json", "w", encoding="utf-8") as file:
    result = json.dumps(test, ensure_ascii=False)
    file.write(result)
```
````

## Создать путь
Создайте функцию, которая создает путь до папки, если этого пути не существует.
Функция должна принимать один аргумент пути до папки в виде строки.
Пример входных данных: `home/music/bands`  
На выходе должны получить созданную папку.
Если папка существует - ничего не делаем.

````{toggle}
```python
import os

mypath = "/home/music/bands/"
def open_path(path):
    parts = path.split("/")
    snake_path = []
    for part in parts:
        if part:
            snake_path.append(part)
            p = "/".join(snake_path)
            if not os.path.exists(p):
                os.mkdir(p)

open_path(mypath)
```
````