# Разные задачки

##  Формат строки (в основном для lua)
Создать функцию, которая принимает строку и форматирует ее, удаляя символы находящиеся в таблице и возвращает итоговый резальтут. 

## Данные строки преобразовать в словарь (СЛОВАРИ)
На вход программе подаются данные в формате ключ=значение, записанные через пробел. Значениями здесь являются целые числа (см. пример ниже). Необходимо прочитать строку с этими данными и на их основе сформировать словарь d, используя функцию dict().
Пример:
>Входные данные: `one=1 two=2 three=3`  
>Выходные данные: `{'one': 1, 'two': 2, 'three': 3}`  

<details><summary>Решение</summary>
<pre>
data = 'one=1 two=2 three=3'
data = data.split()
for i in range(len(data)):
    data[i] = data[i].split('=')

result = dict(data)
print(result)
</pre>
</details>

## Таймер 
Напишите программу, которая принимает время в виде строки "00:00:00", и включает таймер на это время.
По истечению таймера необходимо вывести сообщение в консоль "Время истекло".

## Работники и предприятия 
Описать классы "Работник" и "Предприятие" позволяющие создавать работников, принимать, уволнять, изменять должность, переводить на другое предприятие, изменять зарплату.
1. Создать два класса "Предприятия" и "Работники"
2. Возможность создания объекта "Предприятия", у которого будет название, список работников
3. Возможность создания объекта "Работник", у которого будет имя, предприятие на котором работает, зарплата и должность.
4. Добавление/удаление работника в/из предприятия.
5. Изменять должность работника.
6. Переводить на другое предприятие
7. Работник может так же сам уволиться.


## Коллбэк-функции (callback)

### Обработчик секретных сообщений
Напиши функцию `process_message(message, action)`, которая берет строку и применяет к ней функцию-callback action.  
Задание: Создай три варианта обработки:  
1. `to_shout(text)` — превращает текст в ВЕРХНИЙ РЕГИСТР и добавляет «!!!».  
2. `to_secret(text)` — заменяет все буквы «а» на «@», а «о» на «0».  
3. `to_reverse(text)` — переворачивает строку задом наперед.  

Вызови `process_message` с фразой «привет мир» для каждого из этих действий.  

### Робот-повар  
Создай функцию `cook(item, callback)`, которая имитирует приготовление блюда. Она должна выводить: «Готовлю: [название блюда]...», а затем вызывать callback.  

Задание:  
Создай callback-функции для разных приправ: `add_salt()`, `add_pepper()`, `add_sauce()`. Каждая просто пишет, что добавлена конкретная специя.
Вызови `cook("Пицца", add_sauce)`.  

Усложнение задания:  
Измени функцию так, чтобы она принимала не один коллбэк, а список из нескольких callback-ов `cook(item, callbacks_list)`, и вызывала их по очереди после того, как блюдо «приготовится».  

Совет: В Python функции — это такие же объекты, как числа или строки, поэтому их легко можно складывать в списки: `my_actions = [add_salt, add_sauce]`.  


## Упражнение №1. Проверка и очистка одного сообщения
Цель: Работа с методами strip(), lower(), replace() и базовыми условиями if/else.
Задание:
Дана строка raw_message = " ВНИМАНИЕ! Скидка на все товары ".
Удалите лишние пробелы по краям.
Приведите строку к нижнему регистру для проверки.
Проверьте, содержит ли строка слово "скидка".
Результат: Если слово найдено, выведите «Спам». Если нет — выведите очищенную строку, где первая буква заглавная, а остальные строчные.

## Упражнение №2. Обработка ФИО через индексы списка
Цель: Преобразование строки в список, обращение к элементам по индексу и сборка строки.

Задание:
Дана строка fio_input = " петров иван сидорович ".
Очистите строку от пробелов по краям и разбейте её на список слов (используйте split()).
Сохраните фамилию, имя и отчество в три разные переменные, обращаясь к элементам списка по индексам [0], [1] и [2].
Примените к каждой переменной метод capitalize().
Создайте новый список из этих трех исправленных переменных.

Результат: Объедините элементы итогового списка в одну строку через пробел и выведите её.

## Упражнение №3. Валидация пароля (логические проверки)
Цель: Использование методов isdigit(), isupper(), а также операторов len() и in.

Задание:
Дана строка password = "Admin123".
Создайте пустой список report.
Если длина строки меньше 8, добавьте в список report строку "Короткий".
Если в строке нет ни одной цифры (проверьте наличие конкретной цифры, например '1' in password, или используйте метод any(), если знаком), добавьте "Нет цифр".
Если в строке есть запрещенный символ (например, '!'), добавьте "Символ запрещен".

Результат: Если список report пуст, выведите «Пароль принят». Если нет — выведите содержимое списка.