# Разные задачки

##  Формат строки (в основном для lua)
Создать функцию, которая принимает строку и форматирует ее, удаляя символы находящиеся в таблице и возвращает итоговый резальтут. 

## Данные строки преобразовать в словарь (СЛОВАРИ)
На вход программе подаются данные в формате ключ=значение, записанные через пробел. Значениями здесь являются целые числа (см. пример ниже). Необходимо прочитать строку с этими данными и на их основе сформировать словарь d, используя функцию dict().
Пример:
>Входные данные: `one=1 two=2 three=3`  
>Выходные данные: `{'one': 1, 'two': 2, 'three': 3}`  

<details><summary>Решение</summary>
<pre>
data = 'one=1 two=2 three=3'
data = data.split()
for i in range(len(data)):
    data[i] = data[i].split('=')

result = dict(data)
print(result)
</pre>
</details>

## Таймер 
Напишите программу, которая принимает время в виде строки "00:00:00", и включает таймер на это время.
По истечению таймера необходимо вывести сообщение в консоль "Время истекло".

## Работников и предприятия 
Описать классы "Работник" и "Предприятие" позволяющие создавать работников, принимать, уволнять, изменять должность, переводить на другое предприятие, изменять зарплату.
1. Создать два класса "Предприятия" и "Работники"
2. Возможность создания объекта "Предприятия", у которого будет название, список работников
3. Возможность создания объекта "Работник", у которого будет имя, предприятие на котором работает, зарплата и должность.
4. Добавление/удаление работника в/из предприятия.
5. Изменять должность работника.
6. Переводить на другое предприятие
7. Работник может так же сам уволиться.


## Коллбэк-функции (callback)

### Обработчик секретных сообщений

Напиши функцию `process_message(message, action)`, которая берет строку и применяет к ней функцию-callback action.
Задание: Создай три варианта обработки:
1. `to_shout(text)` — превращает текст в ВЕРХНИЙ РЕГИСТР и добавляет «!!!».
2. `to_secret(text)` — заменяет все буквы «а» на «@», а «о» на «0».
3. `to_reverse(text)` — переворачивает строку задом наперед.

Вызови process_message с фразой «привет мир» для каждого из этих действий.

### Робот-повар  
Представь, что у тебя есть функция `cook(item, callback)`, которая имитирует приготовление блюда. Она должна выводить: «Готовлю: [название блюда]...», а затем вызывать callback.  

Задание:  
Создай callback-функции для разных приправ: `add_salt()`, `add_pepper()`, `add_sauce()`. Каждая просто пишет, что добавлена конкретная специя.
Вызови `cook("Пицца", add_sauce)`.  

Усложнение задания:  
Измени функцию так, чтобы она принимала не один коллбэк, а список из нескольких callback-ов `cook(item, callbacks_list)`, которая принимает список из нескольких callback-ов и вызывает их по очереди после того, как блюдо «приготовится».  

Совет: В Python функции — это такие же объекты, как числа или строки, поэтому их легко можно складывать в списки: `my_actions = [add_salt, add_sauce]`.  

